{
  "HOME": {
    "MISSION": "Imagine. Design. Develop."
  },
  "ABOUT": {
    "INTRO": "./About.exe",
    "SCHOOL": "Computer Science",
    "WORK": "Senior Software Developer at",
    "EMAIL": "Please send all inquiries to",
    "RESUME": "Resume",
    "WELCOME": "Welcome",
    "FREELANCE": "Freelance Software Developer",
    "SABBATICAL": "World Expedition",
    "SABBATICAL_DESCRIPTION": "Circumnavigated the globe across 19 countries; worked as a developer, English teacher, and in hospitality, building cross-cultural communication, language skills, and problem solving."
  },
  "MENU": {
    "HOME": "Home",
    "ABOUT": "About",
    "PROJECTS": "Projects",
    "RESUME": "Resume",
    "CONTACT": "Contact"
  },
  "LANGUAGE": {
    "SELECT": "Select your language",
    "CANCEL": "Cancel",
    "UPDATE": "Update",
    "LANGUAGE": "English"
  },
  "LOGIN": {
    "LOGIN": "Login",
    "LOGOUT": "Logout",
    "ENTER_USERNAME": "Enter a username",
    "USERNAME": "Username",
    "ENTER_EMAIL": "Enter your email",
    "PASSWORD": "Password",
    "ENTER_PASSWORD": "Enter a password",
    "ENTER_FIRST_NAME": "Enter your first name",
    "ENTER_LAST_NAME": "Enter your last name",
    "SIGN_UP": "Sign Up",
    "NOT_EXIST": "Not an existing user? Please Sign Up.",
    "ALREADY_EXIST": "Already an existing user? Please Login.",
    "INVALID_CREDENTIALS": "Invalid Credentials"
  },
  "PROFILE": {
    "PROFILE": "User Profile",
    "FIRST_NAME": "First Name",
    "LAST_NAME": "Last Name",
    "EMAIL": "Email",
    "HEADER_PROFILE": "Profile"
  },
  "MANDELBROT": {
    "WHATIS": "What is the Mandelbrot Set?",
    "TLDR": "The Mandelbrot set is one of the most famous examples of a fractal, revealing infinite complexity within a simple mathematical definition. Its boundary is infinitely detailed and remains a topic of mathematical exploration and artistic representation. I encourage you to click around. Besides clicking manually, you can select a center point in the complex plane defined by its real component a and imaginary component b, then clicking 'Zoom at (a + bi)' to zoom in more and more at a specific point. I recommend doing this multiple times at a = -1.1088165247018740, b = -0.23718282208588953, with max_iterations set to 2000. Note that as you zoom deeper, you must increase the max_iterations value in the UI pane and click 'Recompute' in order to see the fractals in greater detail. This is necessary because as the bounds of the Real and Imaginary planes become closer together (more zoomed in), a greater number of iterations is needed to determine whether the Mandelbrot function is bounded at any complex coordinate c. If you want to zoom in more at each step, increase the zoom factor. You can always return to your previous position by clicking 'Undo Zoom', or return to the original bounds of the Mandelbrot Set by clicking 'Reset'. If you like the Mandelbrot at a specific frame, you can download a screenshot by clicking 'Screenshot'. If you want to record the coordinates and settings for easy input into the UI later, you can click 'Save Coordinates'."
  }
}
